In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('Labs.csv')
df.head()

    ID DRAW_DATE LAB_RESULT_CODE LAB_VALUE
0  1.0    04-Jul           LAB A       679
1  1.0    01-Aug           LAB A       621
2  1.0    05-Sep           LAB A       915
3  1.0    03-Oct           LAB A       848
4  1.0    07-Nov           LAB A       845

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2397 entries, 0 to 2396
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               2095 non-null   float64
 1   DRAW_DATE        2397 non-null   object
 2   LAB_RESULT_CODE  2397 non-null   object
 3   LAB_VALUE        2397 non-null   object
dtypes: float64(1), object(3)
memory usage: 75.0+ KB

In [13]:
df.describe()

                ID
count  2095.000000
mean     65.557041
std      38.453118
min       1.000000
25%      31.000000
50%      66.000000
75%      99.000000
max     129.000000

In [17]:
# missing values per col
df.isnull().sum()

ID                 302
DRAW_DATE            0
LAB_RESULT_CODE      0
LAB_VALUE            0
dtype: int64

In [31]:
import pandas as pd

df = pd.read_csv('Admin.csv')
df

       ID    Med  Admin Date     Units
0       1  Med A  02/07/2012  1,500.00
1       1  Med A  06/07/2012  1,500.00
2       1  Med A  09/07/2012  1,500.00
3       1  Med A  11/07/2012  1,500.00
4       1  Med A  13/07/2012  1,500.00
...   ...    ...         ...       ...
2017  129  Med A  27/08/2012  5,200.00
2018  129  Med A  30/08/2012  5,200.00
2019  129  Med A  04/09/2012  5,200.00
2020  129  Med A  06/09/2012  6,500.00
2021  129  Med B  13/09/2012     10.00

[2022 rows x 4 columns]

In [33]:
df.head()

   ID    Med  Admin Date     Units
0   1  Med A  02/07/2012  1,500.00
1   1  Med A  06/07/2012  1,500.00
2   1  Med A  09/07/2012  1,500.00
3   1  Med A  11/07/2012  1,500.00
4   1  Med A  13/07/2012  1,500.00

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2022 entries, 0 to 2021
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          2022 non-null   int64
 1   Med         2022 non-null   object
 2   Admin Date  2022 non-null   object
 3   Units       2022 non-null   object
dtypes: int64(1), object(3)
memory usage: 63.3+ KB

In [37]:
df.describe()

                ID
count  2022.000000
mean     66.767557
std      37.973341
min       1.000000
25%      32.250000
50%      67.000000
75%     100.000000
max     129.000000

In [39]:
# missing values per col
df.isnull().sum()

ID            0
Med           0
Admin Date    0
Units         0
dtype: int64

In [42]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2017    False
2018    False
2019    False
2020    False
2021    False
Length: 2022, dtype: bool

In [44]:
# Check for duplicates
duplicates = df.duplicated()
print(f"\nNumber of duplicate rows: {duplicates.sum()}")

Number of duplicate rows: 0

In [61]:
# convert int into object
df['ID'] = df['ID'].astype(int)  
df['Med'] = df['Med'].astype('object')

In [67]:
import seaborn as sns

df = sns.load_dataset('titanic')

In [69]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [73]:
import seaborn as sns
from sklearn.preprocessing import StandardScaler
import pandas as pd


# Identify numerical columns (excluding non-numeric ones like age, fare)
numerical_cols = df.select_dtypes(include=['float64', 'int64']).columns

# Initialize the StandardScaler
scaler = StandardScaler()

# Apply standard scaling to numerical columns
df[numerical_cols] = scaler.fit_transform(df[numerical_cols])

print("\nNumerical columns after scaling:")
print(df[numerical_cols].head())

Numerical columns after scaling:
   survived    pclass       age     sibsp     parch      fare
0 -0.789272  0.827377 -0.530377  0.432793 -0.473674 -0.502445
1  1.266990 -1.566107  0.571831  0.432793 -0.473674  0.786845
2  1.266990  0.827377 -0.254825 -0.474545 -0.473674 -0.488854
3  1.266990 -1.566107  0.365167  0.432793 -0.473674  0.420730
4 -0.789272  0.827377  0.365167 -0.474545 -0.473674 -0.486337

In [87]:
# One-hot encoding for categorical variables
df = pd.get_dummies(df, columns=['Sex', 'Embarked', 'Pclass'], drop_first=True)

KeyError: "None of [Index(['Sex', 'Embarked', 'Pclass'], dtype='object')] are in the [columns]"

In [91]:
# Export cleaned dataset
df.to_csv('titanic_cleaned.csv', index=False)